In [2]:
import pandas as pd
df_csv = pd.read_csv('emp.csv')
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     9 non-null      int64
 1   ename   9 non-null      object
 2   edept   9 non-null      object
 3   ecity   9 non-null      object
 4   ecost   9 non-null      int64
dtypes: int64(2), object(3)
memory usage: 492.0+ bytes

In [3]:
products = {}
products['pid']=[101,102,103,104,105]
products['pname']=['pA','pB','pC','pD','pE']
products['pcost']=[1000,234,4442,1230,4500]
import json
with open('test.json','w') as wobj:
    json.dump(products,wobj)

In [4]:
pd.read_json('test.json')

   pid pname  pcost
0  101    pA   1000
1  102    pB    234
2  103    pC   4442
3  104    pD   1230
4  105    pE   4500

In [5]:
df_json = pd.read_json('test.json')

In [7]:
df_excel = pd.read_excel('sales_data.xlsx')

In [8]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     9 non-null      int64
 1   ename   9 non-null      object
 2   edept   9 non-null      object
 3   ecity   9 non-null      object
 4   ecost   9 non-null      int64
dtypes: int64(2), object(3)
memory usage: 492.0+ bytes

In [9]:
df_json.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pid     5 non-null      int64
 1   pname   5 non-null      object
 2   pcost   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [10]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         3 non-null      int64
 1   product    3 non-null      object
 2   amount     3 non-null      int64
 3   sale_date  3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 228.0+ bytes

In [15]:
import sqlite3
conn = sqlite3.connect('emp.db')
cur = conn.cursor()
cur.execute("create table emp(eid INT,ename TEXT,edept TEXT,ecost INT)")

In [16]:
cur.execute("insert into emp(eid,ename,edept,ecost) values(101,'Arun','sales',1000)")

In [17]:
cur.execute("insert into emp(eid,ename,edept,ecost) values(102,'Anu','HR',2000)")
cur.execute("insert into emp(eid,ename,edept,ecost) values(103,'vijay','Prod',3000)")
cur.execute("insert into emp(eid,ename,edept,ecost) values(104,'Leo','sales',4000)")
cur.execute("insert into emp(eid,ename,edept,ecost) values(105,'Paul','sales',5300)")
cur.execute("insert into emp(eid,ename,edept,ecost) values(106,'Bibu','admin',2100)")

In [18]:
conn.commit()

In [19]:
conn.close()

In [20]:
import sqlite3
conn = sqlite3.connect('emp.db')

In [21]:
pd.read_sql_query("select *from emp",conn)

   eid  ename  edept  ecost
0  101   Arun  sales   1000
1  102    Anu     HR   2000
2  103  vijay   Prod   3000
3  104    Leo  sales   4000
4  105   Paul  sales   5300
5  106   Bibu  admin   2100

In [22]:
df_db = pd.read_sql_query("select *from emp",conn)
df_db.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     6 non-null      int64
 1   ename   6 non-null      object
 2   edept   6 non-null      object
 3   ecost   6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [23]:
df_db.to_sql("new_emp",conn)

6

In [24]:
df_csv.to_csv("e1.csv")

In [ ]:
## Collective data (or) more than one values ---> single value
# -----------------------------------------
# [ ...... ] -> max,min,sum,count,avg,groupby...

In [25]:
data = {}
data['depts']=['prod','sales','HR','prod','sales','sales']
data['cost']=[6000,4500,7500,5500,3450,6200]
data['count']=[20,30,28,35,40,45]

df = pd.DataFrame(data)

In [26]:
df

   depts  cost  count
0   prod  6000     20
1  sales  4500     30
2     HR  7500     28
3   prod  5500     35
4  sales  3450     40
5  sales  6200     45

In [28]:
df['cost']

0    6000
1    4500
2    7500
3    5500
4    3450
5    6200
Name: cost, dtype: int64

In [29]:
df['cost'].sum()

np.int64(33150)

In [33]:
print(f"Sum = {df['cost'].sum()}")
print(f"Mean = {df['cost'].mean()}")
print(f"TotalCount = {df['cost'].count()}")

Sum = 33150
Mean = 5525.0
TotalCount = 6

In [34]:
print(f"Standard deviation = {df['cost'].std()}")

Standard deviation = 1409.8758810618756

In [35]:
print(f"Minimum Cost = {df['cost'].min()}")
print(f"Maximum Cost = {df['cost'].max()}")

Minimum Cost = 3450
Maximum Cost = 7500

In [37]:
# SQL 
# select dept,avg(cost) from emp group by dept;

df.groupby("depts")["cost"].mean()

depts
HR       7500.000000
prod     5750.000000
sales    4716.666667
Name: cost, dtype: float64

In [ ]:
df.groupby("depts")["cost"].mean()

In [38]:
df.groupby("depts")["cost"].max() # maximum cost

depts
HR       7500
prod     6000
sales    6200
Name: cost, dtype: int64

In [39]:
df.groupby("depts")["cost"].agg(['mean','max'])

              mean   max
depts
HR     7500.000000  7500
prod   5750.000000  6000
sales  4716.666667  6200

In [40]:
def salary_range(x):  #<== user defined function 
    r = x.max() - x.min()
    return r

df.groupby("depts")['cost'].agg(salary_range)

depts
HR          0
prod      500
sales    2750
Name: cost, dtype: int64

In [ ]:
def salary_range(x):  #<== user defined function 
    return  x.max() - x.min()
###################################################### // lambda 

df.groupby("depts")['cost'].agg(salary_range)

In [41]:
f = lambda x: x.max() - x.min()
df.groupby("depts")['cost'].agg(f)

depts
HR          0
prod      500
sales    2750
Name: cost, dtype: int64

In [42]:
df.groupby("depts")['cost'].agg(lambda x: x.max() - x.min())

depts
HR          0
prod      500
sales    2750
Name: cost, dtype: int64

In [ ]:
####

In [43]:
emp_data = {}
emp_data ['name'] = ['Arun','Vijay','John','Leo']
emp_data ['Age'] = [25,34,33,29]

df = pd.DataFrame(emp_data)
df

    name  Age
0   Arun   25
1  Vijay   34
2   John   33
3    Leo   29

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   Age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [45]:
# Adding new column - dict logic 
df['Cost'] = [1000,2000,3000,4000]
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   Age     4 non-null      int64
 2   Cost    4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [46]:
df.columns

Index(['name', 'Age', 'Cost'], dtype='object')

In [48]:
df['Cost']

0    1000
1    2000
2    3000
3    4000
Name: Cost, dtype: int64

In [49]:
df['Cost'] * 0.18

0    180.0
1    360.0
2    540.0
3    720.0
Name: Cost, dtype: float64

In [50]:
df['Tax'] = df['Cost'] * 0.18
df

    name  Age  Cost    Tax
0   Arun   25  1000  180.0
1  Vijay   34  2000  360.0
2   John   33  3000  540.0
3    Leo   29  4000  720.0

In [54]:
# To add new record/row  -> use .loc 

df.loc[len(df) - 1 ]

name      Leo
Age        29
Cost     4000
Tax     720.0
Name: 3, dtype: object

In [55]:
# To add new record/row  -> use .loc
df.loc[len(df)] = ['Anu',23,4590,240]

In [56]:
df

    name  Age  Cost    Tax
0   Arun   25  1000  180.0
1  Vijay   34  2000  360.0
2   John   33  3000  540.0
3    Leo   29  4000  720.0
4    Anu   23  4590  240.0

In [57]:
# Another way to add new row to an existing dataframe
new_record = {'name':'Theeb','Age':37,'Cost':3000,'Tax':540}

df.loc[len(df)] = new_record

In [58]:
df

    name  Age  Cost    Tax
0   Arun   25  1000  180.0
1  Vijay   34  2000  360.0
2   John   33  3000  540.0
3    Leo   29  4000  720.0
4    Anu   23  4590  240.0
5  Theeb   37  3000  540.0

In [59]:
## Another way
df.loc[6] = ['Bibu',32,1000,180]
df

    name  Age  Cost    Tax
0   Arun   25  1000  180.0
1  Vijay   34  2000  360.0
2   John   33  3000  540.0
3    Leo   29  4000  720.0
4    Anu   23  4590  240.0
5  Theeb   37  3000  540.0
6   Bibu   32  1000  180.0

In [60]:
df.loc[1] = ['Kumar',33,2000,360] ## Index - 1 already exists ->overwrite
df

    name  Age  Cost    Tax
0   Arun   25  1000  180.0
1  Kumar   33  2000  360.0
2   John   33  3000  540.0
3    Leo   29  4000  720.0
4    Anu   23  4590  240.0
5  Theeb   37  3000  540.0
6   Bibu   32  1000  180.0

In [ ]:
df.shape -->(5000,25) 
|
apply - sampling ->random sampling 
|
df.sample(n=50)

In [ ]:
## Tasks
## ------
1. Load emp.csv file ->dataframe
2. get info about loaded dataframe
3. list out row index,column index
4. display df shape
5. Test - any duplicated values are exists --> droup duplicate ->update to input dataframe
6. Test - any null/empty value are exists -> replace 
7. Rename some column
8. Aggregate some column
9. Write cleaned dataframe into new file
-------------------------------------------

In [61]:
# Load the external file
df = pd.read_csv('emp.csv')

# info about file
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     9 non-null      int64
 1   ename   9 non-null      object
 2   edept   9 non-null      object
 3   ecity   9 non-null      object
 4   ecost   9 non-null      int64
dtypes: int64(2), object(3)
memory usage: 492.0+ bytes

In [62]:
# 3. list out row index,column index

print(df.index)
print(df.columns)

RangeIndex(start=0, stop=9, step=1)
Index(['eid', 'ename', 'edept', 'ecity', 'ecost'], dtype='object')

In [63]:
# 4. display df shape
df.shape

(9, 5)

In [65]:
# 5. Test - any duplicated values are exists --> droup duplicate ->update to input dataframe
df.duplicated().sum()

np.int64(0)

In [66]:
# df.drop_duplicated(inplace=True)
# 6. Test - any null/empty value are exists -> replace 

df.isnull().sum()

eid      0
ename    0
edept    0
ecity    0
ecost    0
dtype: int64

In [67]:
# df.fillna(df['cost'].mean(df)*100),inplace=True) # replace NaN value
# 7. Rename some column
df.columns

Index(['eid', 'ename', 'edept', 'ecity', 'ecost'], dtype='object')

In [68]:
df.rename(columns={'edept':'DEPT'},inplace=True)

In [69]:
df.columns

Index(['eid', 'ename', 'DEPT', 'ecity', 'ecost'], dtype='object')

In [70]:
df

   eid    ename   DEPT    ecity  ecost
0  101      raj  sales     pune   1000
1  102      leo   prod   bglore   2301
2  230      raj   prod     pune   2300
3  450     shan  sales   bglore   3401
4  542      anu     HR   mumbai   4590
5  321     bibu  sales      hyd   5419
6  651      ram     hr   bglore   3130
7  541      leo  admin  chennai   4913
8  652  karthik  sales   bglore   3405

In [71]:
# 8. Aggregate some column

df.groupby("DEPT")["ecost"].agg(['mean','max'])

          mean   max
DEPT
HR     4590.00  4590
admin  4913.00  4913
hr     3130.00  3130
prod   2300.50  2301
sales  3306.25  5419

In [72]:
# 9. Write cleaned dataframe into new file

df.to_csv('e1.csv',index=False)

In [73]:
pd.read_csv('e1.csv')

   eid    ename   DEPT    ecity  ecost
0  101      raj  sales     pune   1000
1  102      leo   prod   bglore   2301
2  230      raj   prod     pune   2300
3  450     shan  sales   bglore   3401
4  542      anu     HR   mumbai   4590
5  321     bibu  sales      hyd   5419
6  651      ram     hr   bglore   3130
7  541      leo  admin  chennai   4913
8  652  karthik  sales   bglore   3405